// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

Console.Clear();

Console.WriteLine("Введите число: ");

int number = Convert.ToInt32(Console.ReadLine());
